[
    {
        "_id": "A101",
        "title": "React JS Assignment 1",
        "description": "The assignment is available online. Submit a link to the landing page of your Web application running on Netlify. The landing page should include the following: - Your full name and section- Links to each of the lab assignments - Link to the Kanbas application - Links to all relevant source code repositories. The Kanbas application should include a link to navigate back to the landing page.",
        "course": "1234",
        "available_from_date": "2025-05-07",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-13",
        "display_grade":"Complete/Incomplete",
        "submissiontype":"Online",
        "Assignmentgroup":"ASSIGNMENT",
        "entry":"Website URL",
        "points": "100"
    },
    {
        "_id": "A102",
        "title": "React JS Assignment 2",
        "description": "The assignment is available online. Submit a link to the landing page of your Web application running on Netlify. The landing page should include the following: - Your full name and section- Links to each of the lab assignments - Link to the Kanbas application - Links to all relevant source code repositories. The Kanbas application should include a link to navigate back to the landing page.",
        "course": "1234",
        "available_from_date": "2025-05-13",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-20",
        "display_grade":"Points",
        "submissiontype":"Online",
        "entry":"Website URL",
        "Assignmentgroup":"ASSIGNMENT",
        "points": "100"
    },
    {
        "_id": "A103",
        "title": "React JS Assignment 3",
        "description": "Submit a link to the landing page of your Web application running on Netlify and also the dynamic javascript function used in the assignment in the lab section. The landing page should include the following: - Your full name and section- Links to each of the lab assignments - Link to the Kanbas application - Links to all relevant source code repositories. The Kanbas application should include a link to navigate back to the landing page along with css bootstrap in it.",
        "course": "1234",
        "available_from_date": "2025-05-20",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-27",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "entry":"Website URL",
        "submissiontype":"Online",
        "points": "100"
    },
    {
        "_id": "A201",
        "title": "Design Patterns Assignment 1",
        "description": " This assignment is to completely individually. please review the standards from accademic integrity in teh syllabus. Create a program that  uses vehicles gear transmissino mechanism to create a designed code for automatic transmission. ",
        "course": "5010",
        "available_from_date": "2025-05-07",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-13",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "entry":"File Uploads",
        "submissiontype":"Online",
        "points": "100"
    },
    {
        "_id": "A202",
        "title": "Programming Design  Assignment 2",
        "description": "This assignment is to completed individually. Please review the standards for academic integrity in the syllabus.Our objective is to design a simple calculator that works only with whole numbers. It supports only three arithmetic operations: addition, subtraction and multiplication. To simulate the button press functionality, the calculator accepts inputs one character at a time. For example, to compute 32+243 the inputs would be '3', '2', '+', '2', '4', '3', '=' in that sequence. Our calculator will also support displaying the current state of the calculator (i.e. what we normally see on the calculator screen as we are typing inputs).All your code should be in a package called calculator. Your tests should be in the default package. This ensures that your test can see your classes and interfaces in the same way as any other client.",
        "course": "5010",
        "available_from_date": "2025-05-13",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-20",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A203",
        "title": "Programming Design  Assignment 3",
        "description": "All new code must reside in the mat package. All tests should continue to be in the default package.You must create a class SparseMatrix that implements the given SquareMatrix interface by representing a matrix using links. The above picture is just an illustration, and you are not expected to use only and exactly this representation.May be done in pairs (groups of two) or individually. If done in pairs, both team members must make an individual (and unique) submission and clearly indicate the name of the collaborator in both the submitted file and in a submission comment. Collaborators cannot submit the same code.",
        "course": "5010",
        "available_from_date": "2025-05-20",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-27",
        "display_grade":"Percentage",
        "Assignmentgroup":"QUIZZES",
        "entry":"File Uploads",
        "submissiontype":"Online",
        "points": "100"
    },
    {
        "_id": "A301",
        "title": "Database Assignment 1",
        "description": "Tabular data, i.e. data arranged in rows and columns is a common data representation mechanism. It is used for spreadsheets, CSV data files, and relational databases. In this assignments, we will explore processing of tabular data in CSV files using R.",
        "course": "5800",
        "available_from_date": "2025-05-07",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-13",
        "display_grade":"Complete/Incomplete",
        "Assignmentgroup":"ASSIGNMENT",
        "entry":"File Uploads",
        "submissiontype":"Online",
        "points": "100"
    },
    {
        "_id": "A302",
        "title": "Database  Assignment 2",
        "description": "Most operating systems use a hierarchical file system for storing documents, images, media, programs, and any other type of data in files. The file system can act as a database and is often used to store large file objects, often in conjunction with a database (such as a relational database). In this assignment, you will experiment with navigating the file system in R and implement a simple storage structure for a folder-based document object data store.May be done in pairs (groups of two) or individually. If done in pairs, both team members must make an individual (and unique) submission and clearly indicate the name of the collaborator in both the submitted file and in a submission comment. Collaborators cannot submit the same code. ",
        "course": "5800",
        "available_from_date": "2025-05-13",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-20",
        "display_grade":"Percentage",
        "entry":"File Uploads",
        "Assignmentgroup":"QUIZZES",
        "submissiontype":"Online",
        "points": "100"
    },
    {
        "_id": "A303",
        "title": "Database  Assignment 3",
        "description": "n the context of database design, the conceptual data model stands as a foundational pillar, playing a critical role in shaping the structure and future performance of the database. It serves as a blueprint, guiding developers and stakeholders through the complex landscape of data requirements and relationships. This model, often abstract and technology-agnostic, lays down the groundwork for more detailed and specific design stages, ensuring that the database aligns with the organizational goals and user needs.The importance of conceptual data modeling cannot be overstated; it acts as a communication tool that brings together different stakeholders, including business analysts, developers, and end-users, facilitating a common understanding of the data requirements. This collaborative approach ensures that the database is not only technically sound but also aligns with business objectives and user expectations. Furthermore, a well-designed conceptual model can significantly reduce complexity in later stages of database design, leading to more efficient implementation and easier maintenance. By addressing data inconsistencies and redundancies at an early stage, it also enhances data quality and integrity, which are crucial for reliable decision-making and operational efficiency. In essence, conceptual data modeling is not just a preliminary step; it is the strategic planning phase that determines the success and adaptability of the database system in a rapidly evolving data-driven world.",
        "course": "5800",
        "available_from_date": "2025-05-20",
        "available_until_date": "2025-08-01",
        "display_grade":"Percentage",
        "due_date": "2025-05-27",
        "Assignmentgroup":"QUIZZES",
        "entry":"File Uploads",
        "submissiontype":"Online",
        "points": "100"
        
    },
    {
        "_id": "A401",
        "title": "Unsupervisedd ml Assignment 1",
        "description": "Step into the role of a digital archaeologist and unearth the concealed structures within your data! In this assignment, you'll experiment with clustering algorithms such as K-Means, DBSCAN, and hierarchical clustering to reveal natural groupings. Your mission is to: preprocess, cluster and visualize.",
        "course": "4567",
        "available_from_date": "2025-05-07",
        "available_until_date": "2025-08-01",
        "display_grade":"Points",
        "due_date": "2025-05-13",
        "Assignmentgroup":"ASSIGNMENT",
        "entry":"File Uploads",
        "submissiontype":"On Paper",
        "points": "100"
    },
    {
        "_id": "A402",
        "title": "Unsupervisedd ml Assignment 2",
        "description": "High-dimensional data can be as intimidating as an unsolvable maze—until you learn to simplify it! Your task is to implement dimensionality reduction techniques such as Principal Component Analysis (PCA), t-SNE, or UMAP. ",
        "course": "4567",
        "available_from_date": "2025-05-13",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-20",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A403",
        "title": "Unsupervisedd ml Assignment 3",
        "description": "Become a digital detective on the hunt for outliers! In this assignment, you'll build an unsupervised anomaly detection system using methods like isolation forests, autoencoders, or clustering-based approaches.",
        "course": "4567",
        "available_from_date": "2025-05-20",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-27",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "entry":"File Uploads",
        "submissiontype":"On Paper",
        "points": "100"
    },
    {
        "_id": "A501",
        "title": "Python Assignment 1",
        "description": "Welcome to the mystical world of Python! In this assignment, your task is to write a Python script that goes beyond the ordinary “Hello, World!” Instead, your program should display a whimsical greeting complete with ASCII art and dynamic color effects (using a third‐party package of your choice). This creative twist will introduce you to basic syntax, variables, and simple I/O—while adding a pinch of magic!",
        "course": "5600",
        "available_from_date": "2025-05-07",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-13",
        "display_grade":"Percentage",
        "Assignmentgroup":"QUIZZES",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A502",
        "title": "Python Assignment 2",
        "description": "Design a Python-based calculator that not only performs standard arithmetic operations but also pretends to forecast future calculations! Although it won’t really predict the future, your program should include a “time travel” feature where inputs trigger humorous “predictions” of results. Use functions, conditionals, and loops to build an interactive interface that’s as fun as it is educational.",
        "course": "5600",
        "available_from_date": "2025-05-13",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-20",
        "display_grade":"Percentage",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A503",
        "title": "Python Assignment 3",
        "description": "In this challenge, you’re tasked with generating a randomly created maze using Python’s data structures—lists, dictionaries, and sets. Your program must navigate the maze, track visited cells, and eventually find the exit using a simple pathfinding algorithm. This assignment pushes you to creatively manipulate data and implement algorithms in a scenario that’s as puzzling as it is engaging.",
        "course": "5600",
        "available_from_date": "2025-05-20",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-27",
        "display_grade":"Percentage",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
        
    },
    {
        "_id": "A601",
        "title": "AI Assignment 1",
        "description": "Embark on a journey into the realm of natural language processing by building a chatbot that’s both witty and wise. In this assignment, you'll create a conversational AI using sequence-to-sequence models and pre-trained embeddings. Your bot should understand user inputs, generate creative responses, and even adjust its tone based on the conversation. Dive into techniques like tokenization, attention mechanisms, and sentiment analysis to bring your digital sage to life. Bonus points if your chatbot develops a personality that evolves over time!",
        "course": "5100",
        "available_from_date": "2025-05-07",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-13",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A602",
        "title": "AI Assignment 2",
        "description": "Step into the shoes of a digital detective by developing an AI-powered image analyzer! In this challenge, you'll build a convolutional neural network (CNN) capable of classifying images into a variety of categories—from everyday objects to fantastical creatures. Explore image pre-processing, data augmentation, and transfer learning techniques to boost your model’s performance. As you unravel visual clues hidden within pixel puzzles, you’ll gain hands-on experience with computer vision and deep learning methodologies.",
        "course": "5100",
        "available_from_date": "2025-05-13",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-20",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A603",
        "title": "AI Assignment 3",
        "description": "Prepare to guide an AI agent through a dynamic, simulated environment where every decision counts! In this assignment, you'll create a game or simulation where your agent learns to navigate challenges and achieve goals using reinforcement learning. Implement essential concepts such as reward signals, exploration vs. exploitation, and policy gradients. Watch as your agent masters its environment through trial and error, and discover the power and challenges of teaching machines to learn from experience.",
        "course": "5100",
        "available_from_date": "2025-05-20",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-27",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A701",
        "title": "NLP Assignment 1",
        "description": "Prepare to guide an AI agent through a dynamic, simulated environment where every decision counts! In this assignment, you'll create a game or simulation where your agent learns to navigate challenges and achieve goals using reinforcement learning. Implement essential concepts such as reward signals, exploration vs. exploitation, and policy gradients. Watch as your agent masters its environment through trial and error, and discover the power and challenges of teaching machines to learn from experience.",
        "course": "6120",
        "available_from_date": "2025-05-07",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-13",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A702",
        "title": "NLP Assignment 2",
        "description": "Unlock the emotional code hidden within text! Your mission is to develop a sentiment analysis tool that not only classifies emotions (happy, sad, angry, etc.) but also provides nuanced insights into the underlying sentiments. Leverage techniques like feature extraction, word embeddings, and even transformers to decode the emotional spectrum of written content. Watch as your alchemical model turns raw data into golden insights about human expression.",
        "course": "6120",
        "available_from_date": "2025-05-13",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-20",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    },
    {
        "_id": "A703",
        "title": "NLP Assignment 3",
        "description": "Step into the shoes of a linguistic sleuth! In this challenge, you’ll create an NLP tool that hunts down named entities, topics, and key phrases from a corpus of text. Utilize tokenization, part-of-speech tagging, and state-of-the-art pre-trained models to uncover hidden connections and relationships within the data. As you unravel the mysteries of language, you'll sharpen your skills in data pre-processing and deep linguistic analysis.",
        "course": "6120",
        "available_from_date": "2025-05-20",
        "available_until_date": "2025-08-01",
        "due_date": "2025-05-27",
        "display_grade":"Points",
        "Assignmentgroup":"ASSIGNMENT",
        "submissiontype":"Online",
        "entry":"File Uploads",
        "points": "100"
    }
]